RT-Thread/rt-thread/bsp/stm32/stm32h563-st-nucleo/board/CubeMX_Config/Drivers/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal_comp.c
/**
  **********************************************************************************************************************
  * @file    stm32h5xx_hal_comp.c
  * @author  MCD Application Team
  * @brief   COMP HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the COMP peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral control functions
  *           + Peripheral state functions
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  @verbatim
  ======================================================================================================================
                                     ##### COMP Peripheral features #####
  ======================================================================================================================

  [..]
      The STM32H5xx device family integrates one analog comparator instance: COMP1.
      (#) Comparators input minus (inverting input) and input plus (non inverting input)
          can be set to internal references or to GPIO pins
          (refer to GPIO list in reference manual).

      (#) Comparators output level is available using HAL_COMP_GetOutputLevel()
          and can be redirected to other peripherals: GPIO pins (in mode
          alternate functions for comparator), timers.
          (refer to GPIO list in reference manual).

      (#) The comparators have interrupt capability through direct line to NVIC (featuring
          low latency interrupt).
          Caution: Specific behavior for comparator of this STM32 series: comparator output triggers interruption
                   on high level
          - triggering on level (instead of edge) implies to disable interrupt in comparator IRQ handler.
            In case of further operation needed in interrupt mode, comparator interruption must be rearmed.
          - triggering on high level implies that comparator output initial state must at low level.
            Then, comparator can trig signal on rising edge.
            Trigger a signal on falling edge is possible by inverting comparator polarity.

  ======================================================================================================================
                                       ##### How to use this driver #####
  ======================================================================================================================
  [..]
      This driver provides functions to configure and program the comparator instances of
      STM32H5xx devices.

      To use the comparator, perform the following steps:

      (#)  Initialize the COMP low level resources by implementing the HAL_COMP_MspInit():
      (++) Configure the GPIO connected to comparator inputs plus and minus in analog mode
           using HAL_GPIO_Init().
      (++) If needed, configure the GPIO connected to comparator output in alternate function mode
           using HAL_GPIO_Init().
      (++) If required enable the COMP interrupt by configuring and enabling EXTI line in Interrupt mode and
           selecting the desired sensitivity level using HAL_GPIO_Init() function. After that enable the comparator
           interrupt vector using HAL_NVIC_EnableIRQ() function.

      (#) Configure the comparator using HAL_COMP_Init() function:
      (++) Select the input minus (inverting input)
      (++) Select the input plus (non-inverting input)
      (++) Select the hysteresis
      (++) Select the blanking source
      (++) Select the output polarity
      (++) Select the power mode
      -@@- HAL_COMP_Init() calls "HAL_COMP_MspInit()", COMP clock enable using system RCC
           must be implemented in this function.

      (#) Reconfiguration on-the-fly of comparator can be done by calling again
          function HAL_COMP_Init() with new input structure parameters values.

      (#) Enable the comparator using HAL_COMP_Start(), HAL_COMP_Start_IT_OneShot() or HAL_COMP_Start_IT_AutoRearm()
          Note: Using HAL_COMP_Start_IT_OneShot() or HAL_COMP_Start_IT_AutoRearm(), these functions can change
                comparator output polarity to match initial comparator output level constraint.
          Note: Using HAL_COMP_Start_IT_OneShot(), after each interruption triggered the interruption
                is disabled in IRQ handler. If needed, comparartor interruption can be rearmed by calling again
                start function.
          Note: In case of comparator and interruption used to exit from low power mode, user most ensure of stable
                comparator input voltage (risk would be that comparator trigs early and IT disabled in IRQ handler
                before device entering in low power mode, inducing no further system wake up possible).
                Most appropriate function is HAL_COMP_Start_IT_AutoRearm() because comparartor triggers remains enable,
                ensuring system wake up capability.

      (#) Use HAL_COMP_TriggerCallback() or HAL_COMP_GetOutputLevel() functions
          to manage comparator outputs (events and output level).

      (#) Disable the comparator using HAL_COMP_Stop() or HAL_COMP_Stop_IT() functions.

      (#) De-initialize the comparator using HAL_COMP_DeInit() function.

      (#) For safety purpose, comparator configuration can be locked using HAL_COMP_Lock() function.
          The only way to unlock the comparator is a device hardware reset.

    *** Callback registration ***
    =============================================
    [..]

