RT-Thread/rt-thread/bsp/stm32/stm32h563-st-nucleo/board/CubeMX_Config/Drivers/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal_comp.c
  /* Check the COMP handle allocation and lock status */
  if (hcomp == NULL)
  {
    status = HAL_ERROR;
  }
  else if (__HAL_COMP_IS_LOCKED(hcomp))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check the parameter */
    assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

    if (hcomp->State == HAL_COMP_STATE_READY)
    {
      /* Enable the selected comparator */
      SET_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_EN);

      /* Set HAL COMP handle state */
      hcomp->State = HAL_COMP_STATE_BUSY;

      /* Delay for COMP startup time */
      /* Wait loop initialization and execution */
      /* Note: Variable divided by 2 to compensate partially              */
      /*       CPU processing cycles, scaling in us split to not          */
      /*       exceed 32 bits register capacity and handle low frequency. */
      wait_loop_index = ((COMP_DELAY_STARTUP_US / 10UL) * ((SystemCoreClock / (100000UL * 2UL)) + 1UL));
      while (wait_loop_index != 0UL)
      {
        wait_loop_index--;
      }

      /* Check whether initial comparator output level is compliant with interruption mode */
      if (hcomp->Init.TriggerMode == COMP_EXTI_FALLING)
      {
        if (HAL_COMP_GetOutputLevel(hcomp) != COMP_OUTPUT_LEVEL_HIGH)
        {
          polarity_toggle = 1U;
        }
      }
      else /* COMP_EXTI_RISING */
      {
        if (HAL_COMP_GetOutputLevel(hcomp) != COMP_OUTPUT_LEVEL_LOW)
        {
          polarity_toggle = 1U;
        }
      }

      if (polarity_toggle == 1U)
      {
        /* Toggle poarity */
        if (READ_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_POLARITY) == 0UL)
        {
          SET_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_POLARITY);
        }
        else
        {
          CLEAR_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_POLARITY);
        }
      }

      /* Enable comparator interruption */
      hcomp->InterruptAutoRearm = 0U;
      __HAL_COMP_CLEAR_FLAG(COMP_CLEAR_C1IF);
      SET_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_ITEN);
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}

/**
  * @brief  Start the comparator with interruption low latency, interruption rearmed at each trigger occurrence.
  * @note   Interruption low latency is achieved through direct line to NVIC (instead of going through EXTI).
  * @note   If needed, comparartor interruption can be rearmed by calling again this function.
  * @note   Specific to comparator of this STM32 series: comparator output triggers interruption on high level.
            This function can change output polarity depending on initial output level.
  * @param  hcomp COMP handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_COMP_Start_IT_AutoRearm(COMP_HandleTypeDef *hcomp)
{
  __IO uint32_t wait_loop_index = 0UL;
  uint32_t polarity_toggle = 0U;
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the COMP handle allocation and lock status */
  if (hcomp == NULL)
  {
    status = HAL_ERROR;
  }
  else if (__HAL_COMP_IS_LOCKED(hcomp))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check the parameter */
    assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

    if (hcomp->State == HAL_COMP_STATE_READY)
    {
      /* Enable the selected comparator */
      SET_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_EN);

      /* Set HAL COMP handle state */
      hcomp->State = HAL_COMP_STATE_BUSY;

      /* Delay for COMP startup time */
      /* Wait loop initialization and execution */
      /* Note: Variable divided by 2 to compensate partially              */
      /*       CPU processing cycles, scaling in us split to not          */
      /*       exceed 32 bits register capacity and handle low frequency. */
      wait_loop_index = ((COMP_DELAY_STARTUP_US / 10UL) * ((SystemCoreClock / (100000UL * 2UL)) + 1UL));
      while (wait_loop_index != 0UL)
      {
        wait_loop_index--;
      }

      /* Check whether initial comparator output level is compliant with interruption mode */
      if (hcomp->Init.TriggerMode == COMP_EXTI_FALLING)
      {
        if (HAL_COMP_GetOutputLevel(hcomp) != COMP_OUTPUT_LEVEL_HIGH)
        {
          polarity_toggle = 1U;
        }
      }
      else /* COMP_EXTI_RISING */
      {
        if (HAL_COMP_GetOutputLevel(hcomp) != COMP_OUTPUT_LEVEL_LOW)
        {
          polarity_toggle = 1U;
        }
      }

      if (polarity_toggle == 1U)
      {
        /* Toggle poarity */
        if (READ_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_POLARITY) == 0UL)
        {
          SET_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_POLARITY);
        }
        else
        {
          CLEAR_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_POLARITY);
        }
      }

      /* Enable comparator interruption */
      hcomp->InterruptAutoRearm = 1U;
      __HAL_COMP_CLEAR_FLAG(COMP_CLEAR_C1IF);
      SET_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_ITEN);
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}

/**
  * @brief  Disable the interrupt and Stop the comparator.
  * @param  hcomp COMP handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_COMP_Stop_IT(COMP_HandleTypeDef *hcomp)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the COMP handle allocation and lock status */
  if (hcomp == NULL)
  {
    status = HAL_ERROR;
  }
  else if (__HAL_COMP_IS_LOCKED(hcomp))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check the parameter */
    assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

    /* Check compliant states: HAL_COMP_STATE_READY or HAL_COMP_STATE_BUSY    */
    /* (all states except HAL_COMP_STATE_RESET and except locked status.      */
    if (hcomp->State != HAL_COMP_STATE_RESET)
    {
      /* Disable the selected comparator */
      CLEAR_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_EN);

      /* Disable the EXTI Line interrupt mode */
      CLEAR_BIT(EXTI->IMR1, COMP_GET_EXTI_LINE(hcomp->Instance));

      /* Disable the Interrupt comparator */
      CLEAR_BIT(hcomp->Instance->CFGR1, COMP_CFGR1_ITEN);

      /* Set HAL COMP handle state */
      hcomp->State = HAL_COMP_STATE_READY;
    }
    else
    {
      status = HAL_ERROR;
    }
  }

